In [1]:
people = {
    'first':['Corey','Jane','John'],
    'last':['Schafer','Doe','Doe'],
    'email':['CoreyMSchafer@email.com','JaneDoe@email.com','JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df =pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [8]:
df.columns = [x.upper() for x in df.columns]

In [9]:
df

   FIRST     LAST                    EMAIL
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [10]:
df.columns = ['FIRST_NAME','LAST_NAME','EMAIL']

In [11]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [22]:
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [19]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@email.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [23]:
df.apply(len)

FIRST_NAME    3
LAST_NAME     3
EMAIL         3
dtype: int64

In [27]:
df.applymap(len)

   FIRST_NAME  LAST_NAME  EMAIL
0           5          7     23
1           4          3     17
2           4          3     17